#### One hot encoding

In [6]:
import pandas as pd

In [7]:
df=pd.read_csv('titanic.csv',usecols=['Sex'])

In [8]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [12]:
pd.get_dummies(df,drop_first=True)

     Sex_male
0           1
1           0
2           0
3           0
4           1
..        ...
886         1
887         0
888         0
889         1
890         1

[891 rows x 1 columns]

In [13]:
df=pd.read_csv('titanic.csv',usecols=['Embarked'])

In [14]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [20]:
df.dropna(inplace=True)

In [24]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

##### Disadvantage of one hot encoding is it creates lot of additional categories

In [25]:
import pandas as pd

In [28]:
df=pd.read_csv('Mercedes.csv',usecols=['X0','X1','X2','X3','X4','X5','X6'])

In [29]:
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [42]:
import numpy as np
#Every feature has so many different features if we use one hot encoding 
#then it will create lot of additional features which will lead to 
#curse of dimensionality
for i in df.columns:
    print(len(df[i].value_counts()))

47
27
44
7
4
29
12

If we have so many categories present in some specific column
so we do not use one hot encoding directly we will only apply it to top 
10 features

In [49]:
lst1=df['X1'].value_counts().index
lst=list(lst1)[0:10]
print(lst)

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [55]:
for i in lst:
    df[i]=np.where(df['X1']==i,1,0)

In [58]:
lst.append('X1')
df[lst]

      aa  s  b  l  v  r  i  a  c  o X1
0      0  0  0  0  1  0  0  0  0  0  v
1      0  0  0  0  0  0  0  0  0  0  t
2      0  0  0  0  0  0  0  0  0  0  w
3      0  0  0  0  0  0  0  0  0  0  t
4      0  0  0  0  1  0  0  0  0  0  v
...   .. .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0  s
4205   0  0  0  0  0  0  0  0  0  1  o
4206   0  0  0  0  1  0  0  0  0  0  v
4207   0  0  0  0  0  1  0  0  0  0  r
4208   0  0  0  0  0  1  0  0  0  0  r

[4209 rows x 11 columns]